In [1]:
import pandas as pd
import geopandas as gpd

In [4]:
zipfile = "zip://../../raw-data/wijkenbuurten2019.zip"
print(f"Loading {zipfile}...")
gdf = gpd.read_file(zipfile)
print(f"Loaded {zipfile}")

Loading zip://../../raw-data/wijkenbuurten2019.zip...
Loaded zip://../../raw-data/wijkenbuurten2019.zip

In [6]:
gdf.head(2)

,BU_CODE,JRSTATCODE,BU_NAAM,WK_CODE,WK_NAAM,GM_CODE,GM_NAAM,IND_WBI,WATER,POSTCODE,...,P_N_W_AL,P_MAROKKO,P_ANT_ARU,P_SURINAM,P_TURKIJE,P_OVER_NW,OPP_TOT,OPP_LAND,OPP_WATER,geometry
0,BU00030000,2019BU00030000,Appingedam-Centrum,WK000300,Wijk 00,GM0003,Appingedam,1,NEE,9901,...,4,0,1,0,0,2,90,84,5,"POLYGON ((252643.203 594343.688, 252674.500 59..."
1,BU00030001,2019BU00030001,Appingedam-West,WK000300,Wijk 00,GM0003,Appingedam,1,NEE,9903,...,4,0,1,0,1,2,163,158,5,"POLYGON ((251260.496 594393.830, 251261.415 59..."

In [7]:
gdf.info()

<class 'geopandas.geodataframe.GeoDataFrame'>
RangeIndex: 13689 entries, 0 to 13688
Data columns (total 42 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   BU_CODE     13689 non-null  object
 1   JRSTATCODE  13689 non-null  object
 2   BU_NAAM     13689 non-null  object
 3   WK_CODE     13689 non-null  object
 4   WK_NAAM     13689 non-null  object
 5   GM_CODE     13689 non-null  object
 6   GM_NAAM     13689 non-null  object
 7   IND_WBI     13689 non-null  int64
 8   WATER       13689 non-null  object
 9   POSTCODE    13594 non-null  object
 10  DEK_PERC    13689 non-null  int64
 11  OAD         13689 non-null  int64
 12  STED        13689 non-null  int64
 13  BEV_DICHTH  13689 non-null  int64
 14  AANT_INW    13689 non-null  int64
 15  AANT_MAN    13689 non-null  int64
 16  AANT_VROUW  13689 non-null  int64
 17  P_00_14_JR  13689 non-null  int64
 18  P_15_24_JR  13689 non-null  int64
 19  P_25_44_JR  13689 non-null  int64
 20  P_45_64_JR  13689 non-null  int64
 21  P_65_EO_JR  13689 non-null  int64
 22  P_ONGEHUWD  13689 non-null  int64
 23  P_GEHUWD    13689 non-null  int64
 24  P_GESCHEID  13689 non-null  int64
 25  P_VERWEDUW  13689 non-null  int64
 26  AANTAL_HH   13689 non-null  int64
 27  P_EENP_HH   13689 non-null  int64
 28  P_HH_Z_K    13689 non-null  int64
 29  P_HH_M_K    13689 non-null  int64
 30  GEM_HH_GR   13689 non-null  float64
 31  P_WEST_AL   13689 non-null  int64
 32  P_N_W_AL    13689 non-null  int64
 33  P_MAROKKO   13689 non-null  int64
 34  P_ANT_ARU   13689 non-null  int64
 35  P_SURINAM   13689 non-null  int64
 36  P_TURKIJE   13689 non-null  int64
 37  P_OVER_NW   13689 non-null  int64
 38  OPP_TOT     13689 non-null  int64
 39  OPP_LAND    13689 non-null  int64
 40  OPP_WATER   13689 non-null  int64
 41  geometry    13689 non-null  geometry
dtypes: float64(1), geometry(1), int64(31), object(9)
memory usage: 4.4+ MB

In [36]:
df = pd.DataFrame()
df["A"] = pd.Series(range(1,8))
df["B"] = pd.Series(["str"]*7)
df.where(df[])

   A    B
0  1  str
1  2  str
2  3  str
3  4  str
4  5  str
5  6  str
6  7  str

In [43]:
df["A"].where(df["A"] > 3, inplace=True)
df

     A    B
0  NaN  str
1  NaN  str
2  NaN  str
3  4.0  str
4  5.0  str
5  6.0  str
6  7.0  str

In [46]:
inwgem = pd.DataFrame(gdf[["GM_NAAM","AANT_INW"]])
inwgem.where(inwgem["AANT_INW"] > 0, inplace=True)
inwgem.head()

      GM_NAAM  AANT_INW
0  Appingedam    2370.0
1  Appingedam    3035.0
2  Appingedam    5725.0
3  Appingedam     325.0
4  Appingedam     100.0

In [55]:
inwgem = inwgem.groupby(["GM_NAAM"]).sum()
inwgem.reset_index(inplace=True)
inwgem

              GM_NAAM  AANT_INW
0       's-Gravenhage  537525.0
1    's-Hertogenbosch  153990.0
2         Aa en Hunze   25485.0
3            Aalsmeer   31710.0
4              Aalten   26975.0
..                ...       ...
350           Zundert   21590.0
351           Zutphen   47545.0
352   Zwartewaterland   22580.0
353       Zwijndrecht   44490.0
354            Zwolle  127425.0

[355 rows x 2 columns]